import { Injectable } from '@angular/core';
import { News } from 'src/models/news.model';

@Injectable({
  providedIn: 'root'
})
export class NewsService {
  constructor() { }

  getNews(): News[]
  {
    return [


      new News(
        1,
        "ფოტოკონკურსი „რაკურსი 2021“",
        new Date('2021-06-15'),
        'მაგთიკომისა და ნეოსტუდიის ფოტოკონკურსი „რაკურსი“ გრძელდება.გამარჯვებულებს, მაგთიკომისა და ნეოსტუდიის გუნდთან ერთად, პროფესიონალი ფოტოგრაფი ნათელა გრიგალაშვილი შეარჩევს!„ზაფხული განსაკუთრებულად კარგი დროა მოგზაურობისა და გადაღებისთვის. იქნება ეს მთის ულამაზესი კურორტები და სოფლები, სადაც ადგილობრივები მთელი სეზონის მანძილზე გამალებულ შრომაში არიან, თუ ზღვის ცხელი სანაპიროები, ურიცხვი დამსვენებლებით - აღმოჩენების მოყვარულ ფოტოგრაფებს ყველგან არაჩვეულებრივი კადრები ელით. დიდი იმედი მაქვს, რომ მონაწილეები სრულად გამოიყენებენ იმ შესაძლებლობებს, რასაც მათ საქართველოს მრავალფეროვანი გარემო ანიჭებთ“. - ნათელა გრიგალაშვილი.ივლისის 2 გამარჯვებული ფოტოს ავტორისთვის პრიზები:500 ლარი 5 000 მბ მაგთის უსწრაფესი მობილური ინტერნეტი გაითვალისწინე:თემაზე „ზაფხულის ცხელი დღეები“ მონაწილეობა შესაძლებელია მხოლოდ 1 ფოტოთი.ფოტოები მიიღება 31 ივლისის ჩათვლით. გამარჯვებულები გამოვლინდებიან 5 აგვისტოს.კონკურსში მონაწილეობის მისაღებად მაგთიკომის ინსტაგრამ გვერდზე,პირადი შეტყობინებით, უნდა გამოგვიგზავნო შენი გადაღებული ერთი ფოტო და დაელოდო ჩვენს პასუხს.კონკურსის შესახებ სრული ინფორმაცია',
        '../assets/pictures/angle-2021.jpg'),
      
      
      new News(
        2,
        "სტატისტიკა და დეტალური“",
        new Date('2021-05-18'),
        'გაინტერესებს რამდენ MB-ს ხარჯავ?ან რამდენ წუთს იყენებ?მაგთის მობილური აპლიკაციით MyMagti უკვე შეგიძლია დისტანციურად, ოფისში მისვლის გარეშე, მიიღო მობილური ნომრის სტატისტიკა და დეტალური ამონაწერი.სტატისტიკის მოთხოვნის შემდეგ, მარტივად შეძლებ, ნახო საკუთარ მობილურ ნომერზე  თანხის, წუთების, SMS-ისა და ინტერნეტის დანახარჯი ან ანგარიშზე შეტანილი თანხა.ნომრის დეტალური ამონაწერის მოთხოვნის შემთხვევაში მიიღებ ინფორმაციას გამავალი ან შემომავალი ზარების და SMS-ების ნომრების შესახებ. დეტალური ამონაწერი სრულად ასახავს მოთხოვნილ ნომერზე განხორციელებული ქმედებების დროს, ხანგრძლივობასა და ღირებულებას.MyMagti - მაგთის ოფისი შენს სმარტფონში!',
        '../assets/pictures/statistics.jpg'),
      
      
      new News(
        3,
        "ონლაინ შეკვეთა",
        new Date(''),
        'ისარგებლე მაგთის დისტანციური მომსახურებით ონლაინ შეკვეთა და მიიღე სასურველი სერვისი სახლიდან გაუსვლელად.სასურველი ნომრის შერჩევა/შეძენა;პორტირება;SIM-ბარათის შეძენა/შეცვლა;SIM-ბარათის შეცვლა eSIM-ით;მოდემის შეძენა (TL-MR6400);ტელევიზიის დისტანციური მართვის პულტის შეძენა.',
        '../assets/pictures/online-order.jpg'),
      
      
      new News(
        4,
        "Setanta-ს არხები მაგთიზე!",
        new Date('2021-30-19'),
        'სიახლე სპორტის მოყვარულებს - Setanta-ს არხები მაგთიზე!მაგთისატსა და მაგთი IPTV-ზე უყურეთ ისეთ მაღალრეიტინგულ სპორტულ ტურნირებს, როგორიცაა:Serie A Bundesliga Ligue 1 NBA Formula 1 TOP 14 Jupiler SPFL NHL არხები: Setanta Sports და Setanta Sports+ არხებით სარგებლობის ღირებულება - 2₾  თვეში (30 დღე).',
        '../assets/pictures/setanta.jpg'),
      
      
      new News(
        5,
        "სასარგებლო რჩევები ინტერნეტ მომხმარებლებს“",
        new Date('2021-06-15'),
        '',
        '../assets/pictures/wifi-useful-tips.jpg'),
      
      
    ]
  }


}
