import { Injectable } from '@angular/core';
import { Statement } from 'src/models/statement.model';

@Injectable({
  providedIn: 'root'
})
export class StatementService {
  constructor() { }



  getStatementContent():Statement[]
  {
    return [
      new Statement(
        1,
        "კიბერშეტევა მაგთიკომის ქსელურ ინფრასტრუქტურაზე",
        new Date('2021-07-12'),
        "შაბათს, 10 ივლისს, მაგთიკომის ქსელურ ინფრასტრუქტურაზე მძლავრი კიბერშეტევა განხორციელდა. ამის შედეგად შეფერხებით მუშაობდა მაგთიკომის სერვის ცენტრები, ცხელი ხაზი და ზოგიერთი დისტანციური მომსახურება. მაგთიკომის გუნდის მიერ იმავე დღეს სრულად იქნა აღმოფხვრილი კიბერთავდასხმის ნეგატიური შედეგები.მაგთიკომმა ოპერატიულად ჩააყენა საქმის კურსში ყველა შესაბამისი სახელმწიფო უწყება კომპანიის კუთვნილ სასერვერო ინფრასტრუქტურაზე თავდასხმის ფაქტზე, ხოლო შინაგან საქმეთა სამინისტროს ცენტრალური კრიმინალური პოლიციის დეპარტამენტის კიბერდანაშაულთან ბრძოლის სამმართველომ მომხდარ ფაქტზე გამოძიება დაიწყო. ვიმედოვნებთ, რომ ერთობლივი ძალისხმევის შედეგად, გამოძიება წარმატებულად წარიმართება და შესაძლებელი გახდება დამნაშავეების იდენტიფიცირება. ამასთან, მაგთიკომი მის პარტნიორ კომპანიებთან (შესაბამისი აპარატურის და პროგრამული უზრუნველყოფის მწარმოებელი კომპანიები) ერთად, განაგრძობს გაზრდილი კიბერუსაფრთხოების რისკების მინიმიზაციის მიზნით აქტიურ თანამშრომლობას. ",
        "../assets/pictures/default-image.jpg"),
      
      new Statement(
        2,
        "მაგთიკომის პოზიცია საქართველოს კომუნიკაციების ეროვნული კომისიის თავმჯდომარის ბატონი კახა ბექაურის 2021 წლის 23 ივნისის ინტერვიუზე",
        new Date('2021-06-24'),
        "ბატონმა კახა ბექაურმა 2021 წლის 23 ივნისის ინტერვიუში, კიდევ ერთხელ, ნათლად დაადასტურა როგორც საკუთარი არაკომპეტენტურობა, ასევე მაგთიკომის საჯარო განცხადებებში დაფიქსირებული საკითხების მართებულობა. პირველ რიგში, ბატონ ბექაურს მოვუწოდებთ კონკრეტულად მიუთითოს მაგთიკომის საჯარო განცხადების ის ნაწილი, რომელიც შეიცავს „დაუსაბუთებელ ბრალდებებს“ და მის „პერსონალურ ცილისწამებას“. მისი მხრიდან ამ მოწოდების იგნორირების შემთხვევაში, საზოგადოებისათვის ნათელი გახდება თუ ვინ არის დაკავებული „დაუსაბუთებელი ბრალდებებით“. რაც შეეხება ინტერვიუში ბატონი ბექაურის მიერ მაგთიკომის მიმართ დაფიქსირებული ბრალდებების ძირითად პათოსს, მისი სიტყვებით:მაგთიკომისთვის ნაწილობრივ გასაგებია ბატონი ბექაურის „პიარული ხრიკების“ უსუსური მცდელობები. თუმცა, გვინდა იგი დავარწმუნოთ, რომ მსგავსი მიდგომები ვერ ფარავს მის არაკომპეტენტურობას და დარგის მუშაობის ელემენტარული პრინციპების არ ცოდნას. სწორედ მის პირად შეუვალობას მიყავს სატელეკომუნიკაციო დარგი და დარგის ეკონომიკა განადგურებისაკენ. ის, რასაც და როგორც ბატონი ბექაური აკეთებს არის დაშორება ევროპის საუკეთესო პრაქტიკებთან  და არა სწრაფვა მათთან დაახლოებისკენ. ცინიზმის ნათელი მაგალითია ევროპული პრაქტიკის მოშველიება საკუთარი უკანონო გადაწყვეტილებების გასამართლებლად, რომელთაც არაფერი აქვთ საერთო წარმატებულ ევროპულ პრაქტიკასთან. მაგთიკომის საჯარო განცხადებები და ღიად, კონსტრუქციულად საუბარი დარგში არსებულ პრობლემებზე განპირობებულია იმით, რომ კომუნიკაციების კომისია არსებითად შორდება ევროპულ ოჯახს და მოქმედებს მათი საუკეთესო პრაქტიკის საპირისპიროდ.მაგთიკომისთვის ბაზრის ლიდერობა, პირველ რიგში,  განსაკუთრებული პასუხისმგებლობაა და ჯანსაღი კონკურენცია არის ის, რაც მუდმივად ავითარებს კომპანიას, არ აძლევს მას მოდუნების საშუალებას. ის რასაც მაგთიკომი ეწინააღმდეგება არის: არაჯანსაღი კონკურენცია და მსგავსი გარემოს შექმნა ან წახალისება; კომუნიკაციების კომისიის მხრიდან - კანონის მოთხოვნების იგნორირება, შერჩევითი სამართალი, არაკომპეტენტურობა, დარგის გამოწვევების არ ცოდნა და ბევრი სხვა სუბიექტური ფაქტორი, თუ ქმედება, რაც დარგში არსებულ, ისედაც მყიფე ბიზნესგარემოს და მის მოთამაშეებს სხვა გამოწვევების/რისკების წინაშე აყენებს. როგორც მაგთიკომის საჯარო განცხადებაშია აღნიშნული, მაგთიკომი არ ეწინააღმდეგება ვირტუალური ოპერატორების (MVNO) არსებობას საქართველოში, თუ ეს ურთიერთობა დაფუძნებული იქნება ბიზნესი ბიზნესთან ურთიერთხელსაყრელ თანამშრომლობაზე, სადაც ხელოვნურად და სუბიექტურად არ ერევა მესამე მხარე (კომუნიკაციების კომისია). მაგთიკომი წინააღმდეგია კომისიის უკანონო გადაწყვეტილების - ვირტუალური ოპერატორების (MVNO) სავალდებულო (იძულებითი) დაშვების რეგულაციის, რომლის მსგავსიც არ არსებობს და არ მოქმედებს არცერთ ევროკავშირის ქვეყანაში. ",
        "../assets/pictures/default-image.jpg"),
      
        new Statement(
          3,
          "მაგთიკომის განცხადება",
          new Date('2021-06-22'),
          "2021 წლის 15 ივნისს მაგთიკომმა საქართველოს პარლამენტს ღია წერილით მიმართა, რომელშიც ასახული იყო მაგთიკომის საჯარო განცხადებები - საქართველოს კომუნიკაციების ეროვნული კომისიის მიერ გამოქვეყნებულ არაკომპეტენტურ, ყალბი ინფორმაციით გაჯერებულ 2020 წლის ანგარიშზე და საქართველოს კომუნიკაციების ეროვნული კომისიის თავმჯდომარის ბატონი კახა ბექაურის ქმედებებზე.აღნიშნულმა ღია წერილმა ფართო საზოგადოების დიდი ინტერესი გამოიწვია, დაგვიკავშირდნენ და გვიკავშირდებიან პარლამენტის წევრები, ფრაქციები, პოლიტიკური პარტიები, მედიის წარმომადგენლები და არასამთავრობო ორგანიზაციები. ამასთან, ვინაიდან გაურკვეველია როდის გაიმართება კომუნიკაციების კომისიის 2019 და 2020 წლების ანგარიშების განხილვა/მოსმენა საქართველოს პარლამენტში და ვინაიდან ჩვენ ჯერ-ჯერობით არ გვაქვს შესაძლებლობა კომუნიკაციების კომისიის ანგარიშის განხილვისას დეტალურად წარმოვაჩინოთ ჩვენი პოზიცია, დაპირებისამებრ ვიწყებთ საჯარო სივრცეში კონკრეტული ფაქტების თემატურ წარმოჩენას საქართველოს კომუნიკაციების ეროვნული კომისიის არაკომპეტენტურ ქმედებებზე, კერძოდ, მსოფლიოში ათი საუკეთესო აუდიტორული კომპანიიდან ექვსის Deloitte-ის, KPMG-ის, BDO-ის, RSM-ის, Nexia-ს და Grant Thornton-ის პასუხები, კომუნიკაციების კომისიის 2020 წლის 16 ოქტომბრის განცხადებაზე:მიუხედავად იმისა, რომ მაგთიკომმა არაერთხელ გააფრთხილა კომუნიკაციების კომისია არსებული რისკების შესახებ და ეს რისკები დადასტურებულ იქნა მსოფლიოში ექვსი საუკეთესო საერთაშორისო აუდიტორული კომპანიის მიერ სათანადო კვლევა/ანალიზის/დასკვნის საფუძველზე, კომისიის მხრიდან დაუსაბუთებლად განხორციელდა მათი უარყოფა. ამ ფაქტების და კვლევების ფონზე, ბუნებრივია, რომ ჩნდება კითხვები, თუ რა საჭიროა კომუნიკაციების კომისიის მხრიდან მსგავსი მავნებლური გადაწყვეტილების ამოქმედება, განსაკუთრებით, იმ პერიოდში, როდესაც მთელს მსოფლიოში და საქართველოშიც სრულიად გაურკვეველი მდგომარეობაა, როგორც პანდემიის და მისი შედეგების, ასევე საქართველოში ეროვნული ვალუტის გაუფასურების მხრივ. ამასთან, საქართველოში თითოეული მობილური აბონენტიდან საშუალო თვიური შემოსავალი 8.6 ლარია! რაც ერთ-ერთი ყველაზე დაბალია ევროპაში, ხოლო საქართველოში მობილური ქსელის ხარისხი ერთ-ერთი საუკეთესოა მსოფლიოში. ამავე დროს, სამი მობილური ოპერატორიდან ორი წმინდა ზარალზეა...შესაბამისად, გაუგებარია აღნიშნული გადაწყვეტილება რა მიზანს ემსახურება? იმას, რომ მომავალში ვერ განვვითარდეთ? თუ სხვამ დაგვიმონოს? თუ დაანგრიოს ქვეყნის ეკონომიკა, უსაფრთხოება  და ყველაფერი ის, რაც აქამდე შექმნილა? აქედან გამომდინარე ჩნდება გონივრული ეჭვი ყოველივე ეს ვინმეს პირად ინტერესს ხომ არ უკავშირდება ან კომუნიკაციების კომისია ხომ არ არის ვირტუალური ოპერატორის (MVNO) მხარე? მაშინ, როდესაც მისი ვალდებულებაა იყოს დარგის ნეიტრალური არბიტრი.",
          "../assets/pictures/default-image.jpg"),
        
        new Statement(
          4,
          "მაგთიკომის ღია წერილი საქართველოს პარლამენტს",
          new Date('2021-06-15'),
          "მაგთიკომი საქართველოს პარლამენტს ღია წერილით მიმართავს, რომელშიც ასახულია მაგთიკომის საჯარო განცხადებები - საქართველოს კომუნიკაციების ეროვნული კომისიის მიერ გამოქვეყნებულ არაკომპეტენტურ, ყალბი ინფორმაციით გაჯერებულ 2020 წლის ანგარიშზე და საქართველოს კომუნიკაციების ეროვნული კომისიის თავმჯდომარის ბატონი კახა ბექაურის ქმედებებზე.",
          "../assets/pictures/default-image.jpg"),
        
        new Statement(
          5,
          "მაგთიკომის განცხადება საქართველოს კომუნიკაციების ეროვნული კომისიის თავმჯდომარის ბატონი კახა ბექაურის ქმედებებზე",
          new Date('2021-06-14'),
          "ელექტრონული კომუნიკაციების შესახებ საქართველოს კანონში 2017 წლის 23 დეკემბერს ცვლილების შეტანის შემდეგ (წყარო - https://matsne.gov.ge/ka/document/view/3980112?publication=0) ამოწურვადი რესურსით სარგებლობის საფასური ირიცხება კომუნიკაციების კომისიის ბიუჯეტში, ნაცვლად სახელმწიფო ბიუჯეტისა. აღნიშნული ცვლილება „გამართლებულ“ იქნა კომისიის ახალი ფუნქციის - საზოგადოებაში მედიაწიგნიერების განვითარების ხელშეწყობის დამატებით. ცნობისათვის ამ ცვლილების შედეგად 2018-2020 წლებში სახელმწიფო ბიუჯეტს დააკლდა და კომისიის ბიუჯეტში გადაინაცვლა 1 499 775, 3 458 472 და 3 120 111 ლარმა (ჯამურად სამ წელიწადში - 8 078 358 ლარი). აღსანიშნავია ის ფაქტიც, რომ ხსენებული თანხის დეტალური ხარჯვითი ნაწილი კომისიის მიერ რატომღაც დაფარულია და არ არის გამჭვირვალე.  არასამთავრობო ორგანიზაციას IDFI-ს სასამართლოში უწევს დავის წარმოება ამ ინფორმაციის წარმოდგენის მოთხოვნით. კომისიის თავმჯდომარემ საზოგადოებას, საქართველოს პრეზიდენტს, პარლამენტს და მთავრობას დაუმალა, რომ კომისიის 2018 წლის 25 დეკემბრის N8 დადგენილებით (რომელიც ამოქმედდა 2019 წელს) 150 პროცენტით გაზარდა მობილური საკომუნიკაციო მომსახურებისათვის გამოყოფილი ნუმერაციის რესურსით სარგებლობის საფასური - ყოველგვარი არგუმენტაციის და დასაბუთების გარეშე ერთი მობილური ნომრის წლიური საფასური 10 თეთრიდან გაზარდა 25 თეთრამდე. ეს ფაქტი რატომღაც არ მოხვდა კომისიის არც 2018 წლის და არც 2019 წლის ანგარიშში. კომისიის 2018 წლის 2 აგვისტოს #455/22 გადაწყვეტილებით საზოგადოებაში მედიაწიგნიერების განვითარებისა და მისი ხელშეწყობის მიზნების მისაღწევად დაფუძნდა არასამეწარმეო (არაკომერციული) იურიდიული პირი ,,მედიააკადემია“. „მედიააკადემიის“ წესდებით (მუხლი 5) აკადემიის საქმიანობას ხელმძღვანელობს და წარმოადგენს აღმასრულებელი დირექტორი, რომელსაც ერთპიროვნულად ნიშნავს და ათავისუფლებს საქართველოს კომუნიკაციების ეროვნული კომისიის თავმჯდომარე. მედიაწიგნიერების ხარჯებმა 2018-2020 წლებში შეადგინა 410 438,  2 415 808 და 1 979 053 ლარი (ჯამურად სამ წელიწადში - 4 805 299 ლარი), თუმცა ამ ხარჯების დეტალიზაცია, როგორც უკვე აღინიშნა, არ არის საჯარო და გამჭვირვალე.„მედიააკადემიის“ კონკრეტული ბიუჯეტის და მისი დეტალიზებული ხარჯვითი ნაწილის ფარულობის პარალელურად, აღსანიშნავია ის ფაქტი, რომ ეკა ბერიძე (კომისიის თავმჯდომარის მეუღლე) გვევლინება  ხსენებული იურიდიული პირის კონკრეტულ აქტივობებში, თუმცა ვინაიდან ამ ორგანიზაციის ხარჯვითი ნაწილი რატომღაც არასაჯაროა, უცნობია აღწერილი პირების თანამშრომლობის კონკრეტული პირობები, მათ შორის, ანაზღაურების ნაწილი. ამასთან, კომისიის ბიუჯეტის ხარჯვა საკუთარი მეუღლის რეკლამირებაში შემდეგი სლოგანით -„ისწავლე საუკეთესოსგან“, როგორც ჩანს, კომისიის თავმჯდომარეს არანაირ  დისკომფორტს არ უქმნის.",
          "../assets/pictures/default-image.jpg"),
        
        
          new Statement(
            6,
            "მაგთიკომის ადმინისტრაციის სამადლობელი წერილი მომხმარებლებს",
            new Date('2021-06-15'),
            "მადლობა",
            "../assets/pictures/default-image.jpg"),
    ]
    
  }



}
